run/tutorials/compressible/rhoSimpleFoam/gasMixing/injectorPipe/0.orig/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 100;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    inlet_air
    {
        type            turbulentMixingLengthDissipationRateInlet;
        mixingLength    0.005;
        value           $internalField;
    }

    inlet_fuel
    {
        type            turbulentMixingLengthDissipationRateInlet;
        mixingLength    0.001;
        value           $internalField;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    "inlet.*"
    {
        type            zeroGradient;
    }

    "wall.*"
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
}


// ************************************************************************* //
